spring/aop.org
* AOP是什么

以事务为例，在很多业务场景中都会用到事务，但是我们不希望在每个业务Service类中都重复事务相关的代码。
我们可以自己写一个源码再加工模块，他会扫描所有Service类，并自动在源码中加上事务相关的代码。
每次打包前，先执行一下这个源码再加工模块，这样就可以实现我们的目标了。

“源码再加工”有一个专门的名词叫做“元编程”，AOP的本质其实也是源码再加工，它也是元编程的一种。
其他的比如Eclipse自动生成getter/setter方法也可以看做是元编程。

下面分析AOP的具体实现。既然是源码再加工，那问题无非是2个: 
1. 在哪里进行再加工
   - joinpoint: 可选的再加工位置: spring aop提供的可选位置只有方法调用
   - pointcut:  如何从可选位置中，选出我们感兴趣的位置
2. 如何进行再加工 (是加入事务还是其他的什么?)
   - advice:       用于给方法加入额外的代码
   - introduction: 用于给类加入额外的接口及实现

最后Aspect类似OOP的class，用于将上面提到的概念封装在一起。

* 概念
1. Aspect: a modularization of a concern that cuts across multiple classes.
2. Join point: a point during the execution of a program, such as the execution of a method or the handling
   of an exception. In Spring AOP, a join point always represents a method execution.
3. Advice: action taken by an aspect at a particular join point. Different types of advice include "around,"
   "before" and "after" advice. Spring model an advice as an interceptor, maintaining a chain of interceptors around the join point.
   #+BEGIN_SRC java
   @Aspect
   public class AdviceExample {
      
      @Around("com.xyz.myapp.SystemArchitecture.businessService()")
      public Object doBasicProfiling(ProceedingJoinPoint pjp) throws Throwable {
         // start stopwatch
         Object retVal = pjp.proceed();
         // stop stopwatch
         return retVal;
      }

      @After("com.xyz.myapp.SystemArchitecture.dataAccessOperation()")
      public void doReleaseLock() {
         // ...
      }
   }
   #+END_SRC
4. Pointcut: a predicate that matches join points. Advice is associated with a pointcut expression and
   runs at any join point matched by the pointcut
   #+BEGIN_SRC java
   @Aspect
   public class SystemArchitecture {

      @Pointcut("within(com.xyz.someapp.web..*)")
      public void inWebLayer() {}
      
      @Pointcut("within(com.xyz.someapp.service..*)")
      public void inServiceLayer() {}
      
      @Pointcut("within(com.xyz.someapp.dao..*)")
      public void inDataAccessLayer() {}
            
      @Pointcut("execution(* com.xyz.someapp..service.*.*(..))")
      public void businessService() {}
      
      @Pointcut("execution(* com.xyz.someapp.dao.*.*(..))")
      public void dataAccessOperation() {}
   }
   #+END_SRC
5. Introduction: declaring additional methods or fields on behalf of a type. Spring AOP allows you to
   introduce new interfaces (and a corresponding implementation) to any advised object.
   #+BEGIN_SRC java
   @Aspect
   public class UsageTracking {
      @DeclareParents(value="com.xzy.myapp.service.*+", defaultImpl=DefaultUsageTracked.class)
      public static UsageTracked mixin;
   }

   UsageTracked usageTracked = (UsageTracked) context.getBean("myService");

   #+END_SRC
6. Target object: object being advised by one or more aspects. Also referred to as the advised object.
   Since Spring AOP is implemented using runtime proxies, this object will always be a proxied object.
7. AOP proxy: an object created by the AOP framework in order to implement the aspect contracts
   (advise method executions and so on). In the Spring Framework, an AOP proxy will be a JDK dynamic
   proxy or a CGLIB proxy.
8. Weaving: linking aspects with other application types or objects to create an advised object. This can
   be done at compile time (using the AspectJ compiler, for example), load time, or at runtime. Spring
   AOP, like other pure Java AOP frameworks, performs weaving at runtime.
9. Advisor: The concept of "advisors" is brought forward from the AOP support defined in Spring 1.2 and does not
   have a direct equivalent in AspectJ. An advisor is like a small self-contained aspect that has a single
   piece of advice. The advice itself is represented by a bean, and must implement one of the advice
   interfaces described in the section called “Advice types in Spring”. Advisors can take advantage of
   AspectJ pointcut expressions though.

The concept of join points, matched by pointcuts, is the key to AOP which distinguishes it from
older technologies offering only interception. Pointcuts enable advice to be targeted independently
of the Object-Oriented hierarchy.

* 核心接口
