spring/aop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>aop</title>
<!-- 2018-01-12 Fri 14:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">aop</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. AOP是什么</a></li>
<li><a href="#sec-2">2. 概念</a></li>
<li><a href="#sec-3">3. 核心接口</a>
<ul>
<li><a href="#sec-3-1">3.1. Pointcut</a></li>
<li><a href="#sec-3-2">3.2. Advice</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Around advice</a></li>
<li><a href="#sec-3-2-2">3.2.2. Before advice</a></li>
<li><a href="#sec-3-2-3">3.2.3. Throws advice</a></li>
<li><a href="#sec-3-2-4">3.2.4. After returning advice</a></li>
<li><a href="#sec-3-2-5">3.2.5. Introduction advice</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. ProxyFactoryBean</a></li>
<li><a href="#sec-3-4">3.4. ProxyFactory</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 源码分析</a></li>
<li><a href="#sec-5">5. 注意点</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> AOP是什么</h2>
<div class="outline-text-2" id="text-1">
<p>
以事务为例，在很多业务场景中都会用到事务，但是我们不希望在每个业务Service类中都重复事务相关的代码。
我们可以自己写一个源码再加工模块，他会扫描所有Service类，并自动在源码中加上事务相关的代码。
每次打包前，先执行一下这个源码再加工模块，这样就可以实现我们的目标了。
</p>

<p>
“源码再加工”有一个专门的名词叫做“元编程”，AOP的本质其实也是源码再加工，它也是元编程的一种。
其他的比如Eclipse自动生成getter/setter方法也可以看做是元编程。
</p>

<p>
下面分析AOP的具体实现。既然是源码再加工，那问题无非是2个: 
</p>
<ol class="org-ol">
<li>在哪里进行再加工
<ul class="org-ul">
<li>joinpoint: 可选的再加工位置: spring aop提供的可选位置只有方法调用
</li>
<li>pointcut:  如何从可选位置中，选出我们感兴趣的位置
</li>
</ul>
</li>
<li>如何进行再加工 (是加入事务还是其他的什么?)
<ul class="org-ul">
<li>advice:       用于给方法加入额外的代码
</li>
<li>introduction: 用于给类加入额外的接口及实现
</li>
</ul>
</li>
</ol>

<p>
最后Aspect类似OOP的class，用于将上面提到的概念封装在一起。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 概念</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Aspect: a modularization of a concern that cuts across multiple classes.
</li>
<li>Join point: a point during the execution of a program, such as the execution of a method or the handling
of an exception. In Spring AOP, a join point always represents a method execution.
</li>
<li>Advice: action taken by an aspect at a particular join point. Different types of advice include "around,"
"before" and "after" advice. Spring model an advice as an interceptor, maintaining a chain of interceptors around the join point.
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848; font-weight: bold;">@Aspect</span>
<span style="color: #989848;">public</span> <span style="color: #989848;">class</span> <span style="color: #0287c8; font-weight: bold;">AdviceExample</span> {

   <span style="color: #989848; font-weight: bold;">@Around</span>(<span style="color: #b85c57;">"com.xyz.myapp.SystemArchitecture.businessService()"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #424242; font-weight: bold;">doBasicProfiling</span>(<span style="color: #0287c8; font-weight: bold;">ProceedingJoinPoint</span> <span style="color: #4fa8a8;">pjp</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">Throwable</span> {
      <span style="color: #40883f;">// </span><span style="color: #40883f;">start stopwatch</span>
      <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">retVal</span> = pjp.proceed();
      <span style="color: #40883f;">// </span><span style="color: #40883f;">stop stopwatch</span>
      <span style="color: #989848;">return</span> retVal;
   }

   <span style="color: #989848; font-weight: bold;">@After</span>(<span style="color: #b85c57;">"com.xyz.myapp.SystemArchitecture.dataAccessOperation()"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">doReleaseLock</span>() {
      <span style="color: #40883f;">// </span><span style="color: #40883f;">...</span>
   }
}
</pre>
</div>
</li>
<li>Pointcut: a predicate that matches join points. Advice is associated with a pointcut expression and
runs at any join point matched by the pointcut
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848; font-weight: bold;">@Aspect</span>
<span style="color: #989848;">public</span> <span style="color: #989848;">class</span> <span style="color: #0287c8; font-weight: bold;">SystemArchitecture</span> {

   <span style="color: #989848; font-weight: bold;">@Pointcut</span>(<span style="color: #b85c57;">"within(com.xyz.someapp.web..*)"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">inWebLayer</span>() {}

   <span style="color: #989848; font-weight: bold;">@Pointcut</span>(<span style="color: #b85c57;">"within(com.xyz.someapp.service..*)"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">inServiceLayer</span>() {}

   <span style="color: #989848; font-weight: bold;">@Pointcut</span>(<span style="color: #b85c57;">"within(com.xyz.someapp.dao..*)"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">inDataAccessLayer</span>() {}

   <span style="color: #989848; font-weight: bold;">@Pointcut</span>(<span style="color: #b85c57;">"execution(* com.xyz.someapp..service.*.*(..))"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">businessService</span>() {}

   <span style="color: #989848; font-weight: bold;">@Pointcut</span>(<span style="color: #b85c57;">"execution(* com.xyz.someapp.dao.*.*(..))"</span>)
   <span style="color: #989848;">public</span> <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">dataAccessOperation</span>() {}
}
</pre>
</div>
</li>
<li>Introduction: declaring additional methods or fields on behalf of a type. Spring AOP allows you to
introduce new interfaces (and a corresponding implementation) to any advised object.
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848; font-weight: bold;">@Aspect</span>
<span style="color: #989848;">public</span> <span style="color: #989848;">class</span> <span style="color: #0287c8; font-weight: bold;">UsageTracking</span> {
   <span style="color: #989848; font-weight: bold;">@DeclareParents</span>(value=<span style="color: #b85c57;">"com.xzy.myapp.service.*+"</span>, defaultImpl=DefaultUsageTracked.<span style="color: #989848;">class</span>)
   <span style="color: #989848;">public</span> <span style="color: #989848;">static</span> <span style="color: #0287c8; font-weight: bold;">UsageTracked</span> <span style="color: #4fa8a8;">mixin</span>;
}

<span style="color: #0287c8; font-weight: bold;">UsageTracked</span> <span style="color: #4fa8a8;">usageTracked</span> = (<span style="color: #0287c8; font-weight: bold;">UsageTracked</span>) context.getBean(<span style="color: #b85c57;">"myService"</span>);
</pre>
</div>
</li>
<li>Target object: object being advised by one or more aspects. Also referred to as the advised object.
Since Spring AOP is implemented using runtime proxies, this object will always be a proxied object.
</li>
<li>AOP proxy: an object created by the AOP framework in order to implement the aspect contracts
(advise method executions and so on). In the Spring Framework, an AOP proxy will be a JDK dynamic
proxy or a CGLIB proxy.
</li>
<li>Weaving: linking aspects with other application types or objects to create an advised object. This can
be done at compile time (using the AspectJ compiler, for example), load time, or at runtime. Spring
AOP, like other pure Java AOP frameworks, performs weaving at runtime.
</li>
<li>Advisor: The concept of "advisors" is brought forward from the AOP support defined in Spring 1.2 and does not
have a direct equivalent in AspectJ. An advisor is like a small self-contained aspect that has a single
piece of advice. The advice itself is represented by a bean, and must implement one of the advice
interfaces described in the section called “Advice types in Spring”. Advisors can take advantage of
AspectJ pointcut expressions though.
</li>
</ol>

<p>
The concept of join points, matched by pointcuts, is the key to AOP which distinguishes it from
older technologies offering only interception. Pointcuts enable advice to be targeted independently
of the Object-Oriented hierarchy.
</p>
</div>
</div>
