spring/aop.org
** Pointcut
   #+BEGIN_SRC java
   public interface Pointcut {
   
      ClassFilter getClassFilter();
   
      MethodMatcher getMethodMatcher();
   }


   public interface ClassFilter {
   
      boolean matches(Class clazz);

   }

   
   public interface MethodMatcher {

      boolean matches(Method m, Class targetClass);

      boolean isRuntime();

      boolean matches(Method m, Class targetClass, Object[] args);
   }
   #+END_SRC

** Advice
*** Around advice
   #+BEGIN_SRC java
   public interface MethodInterceptor extends Interceptor {
      Object invoke(MethodInvocation invocation) throws Throwable;
   }
   #+END_SRC
*** Before advice
    #+BEGIN_SRC java
    public interface MethodBeforeAdvice extends BeforeAdvice {
       void before(Method m, Object[] args, Object target) throws Throwable;
    }
    #+END_SRC
*** Throws advice
    org.springframework.aop.ThrowsAdvice interface does not contain any methods: It is a tag interface identifying that the given object implements
    one or more typed throws advice methods. These should be in the form of:
    #+BEGIN_SRC 
        afterThrowing([Method, args, target], subclassOfThrowable)
    #+END_SRC
    Only the last argument is required. The method signatures may have either one or four arguments,
    depending on whether the advice method is interested in the method and arguments.
*** After returning advice
    #+BEGIN_SRC java
    public interface AfterReturningAdvice extends Advice {
        void afterReturning(Object returnValue, Method m, Object[] args, Object target)
        throws Throwable;
    }
    #+END_SRC
*** Introduction advice
    #+BEGIN_SRC java
    public interface IntroductionInterceptor extends MethodInterceptor {
        boolean implementsInterface(Class intf);
    }

    public interface IntroductionAdvisor extends Advisor, IntroductionInfo {
        ClassFilter getClassFilter();
        void validateInterfaces() throws IllegalArgumentException;
    }
    
    public interface IntroductionInfo {
        Class[] getInterfaces();
    }
    #+END_SRC

