spring/aop.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 核心接口</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Pointcut</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">Pointcut</span> {

   <span style="color: #0287c8; font-weight: bold;">ClassFilter</span> <span style="color: #424242; font-weight: bold;">getClassFilter</span>();

   <span style="color: #0287c8; font-weight: bold;">MethodMatcher</span> <span style="color: #424242; font-weight: bold;">getMethodMatcher</span>();
}


<span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">ClassFilter</span> {

   <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">matches</span>(<span style="color: #0287c8; font-weight: bold;">Class</span> <span style="color: #4fa8a8;">clazz</span>);

}


<span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">MethodMatcher</span> {

   <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">matches</span>(<span style="color: #0287c8; font-weight: bold;">Method</span> <span style="color: #4fa8a8;">m</span>, <span style="color: #0287c8; font-weight: bold;">Class</span> <span style="color: #4fa8a8;">targetClass</span>);

   <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">isRuntime</span>();

   <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">matches</span>(<span style="color: #0287c8; font-weight: bold;">Method</span> <span style="color: #4fa8a8;">m</span>, <span style="color: #0287c8; font-weight: bold;">Class</span> <span style="color: #4fa8a8;">targetClass</span>, <span style="color: #0287c8; font-weight: bold;">Object</span>[] <span style="color: #4fa8a8;">args</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Advice</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Around advice</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">MethodInterceptor</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Interceptor</span> {
   <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #424242; font-weight: bold;">invoke</span>(<span style="color: #0287c8; font-weight: bold;">MethodInvocation</span> <span style="color: #4fa8a8;">invocation</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">Throwable</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Before advice</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">MethodBeforeAdvice</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">BeforeAdvice</span> {
   <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">before</span>(<span style="color: #0287c8; font-weight: bold;">Method</span> <span style="color: #4fa8a8;">m</span>, <span style="color: #0287c8; font-weight: bold;">Object</span>[] <span style="color: #4fa8a8;">args</span>, <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">target</span>) <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">Throwable</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Throws advice</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
org.springframework.aop.ThrowsAdvice interface does not contain any methods: It is a tag interface identifying that the given object implements
one or more typed throws advice methods. These should be in the form of:
</p>
<pre class="example">
afterThrowing([Method, args, target], subclassOfThrowable)
</pre>
<p>
Only the last argument is required. The method signatures may have either one or four arguments,
depending on whether the advice method is interested in the method and arguments.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> After returning advice</h4>
<div class="outline-text-4" id="text-3-2-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">AfterReturningAdvice</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Advice</span> {
    <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">afterReturning</span>(<span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">returnValue</span>, <span style="color: #0287c8; font-weight: bold;">Method</span> <span style="color: #4fa8a8;">m</span>, <span style="color: #0287c8; font-weight: bold;">Object</span>[] <span style="color: #4fa8a8;">args</span>, <span style="color: #0287c8; font-weight: bold;">Object</span> <span style="color: #4fa8a8;">target</span>)
    <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">Throwable</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> Introduction advice</h4>
<div class="outline-text-4" id="text-3-2-5">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">IntroductionInterceptor</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">MethodInterceptor</span> {
    <span style="color: #0287c8; font-weight: bold;">boolean</span> <span style="color: #424242; font-weight: bold;">implementsInterface</span>(<span style="color: #0287c8; font-weight: bold;">Class</span> <span style="color: #4fa8a8;">intf</span>);
}

<span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">IntroductionAdvisor</span> <span style="color: #989848;">extends</span> <span style="color: #0287c8; font-weight: bold;">Advisor</span>, <span style="color: #0287c8; font-weight: bold;">IntroductionInfo</span> {
    <span style="color: #0287c8; font-weight: bold;">ClassFilter</span> <span style="color: #424242; font-weight: bold;">getClassFilter</span>();
    <span style="color: #0287c8; font-weight: bold;">void</span> <span style="color: #424242; font-weight: bold;">validateInterfaces</span>() <span style="color: #989848;">throws</span> <span style="color: #0287c8; font-weight: bold;">IllegalArgumentException</span>;
}

<span style="color: #989848;">public</span> <span style="color: #989848;">interface</span> <span style="color: #0287c8; font-weight: bold;">IntroductionInfo</span> {
    <span style="color: #0287c8; font-weight: bold;">Class</span>[] <span style="color: #424242; font-weight: bold;">getInterfaces</span>();
}
</pre>
</div>
</div>
</div>
</div>
