spring/aop.org
** ProxyFactoryBean

   #+BEGIN_SRC xml
   <bean id="myAdvisor" class="com.mycompany.MyAdvisor">
     <property name="someProperty" value="Custom string property value"/>
   </bean>

   <bean id="debugInterceptor" class="org.springframework.aop.interceptor.DebugInterceptor"/>

   <bean id="person" class="org.springframework.aop.framework.ProxyFactoryBean">
     <property name="proxyInterfaces" value="com.mycompany.Person"/>
     <!-- Use inner bean, not local reference to target -->
     <property name="target">
       <bean class="com.mycompany.PersonImpl">
         <property name="name" value="Tony"/>
         <property name="age" value="51"/>
       </bean>
     </property>
     <property name="interceptorNames">
       <list>
         <value>myAdvisor</value>
         <value>debugInterceptor</value>
       </list>
     </property>
   </bean>
   #+END_SRC

The value can be advisor or advice.If you added an interceptor or other advice type, Spring
will have wrapped this in an advisor with a pointcut that always returns true. Thus if you added a
MethodInterceptor, the actual advisor returned will be an DefaultPointcutAdvisor which
returning your MethodInterceptor and a pointcut that matches all classes and methods.

** ProxyFactory
   #+BEGIN_SRC java
   ProxyFactory factory = new ProxyFactory(myBusinessInterfaceImpl);
   factory.addAdvice(myMethodInterceptor);
   factory.addAdvisor(myAdvisor);
   MyBusinessInterface tb = (MyBusinessInterface) factory.getProxy();
   #+END_SRC
* 源码分析

   #+BEGIN_SRC java
   <bean class="org.springframework.aop.framework.autoproxy.InfrastructureAdvisorAutoProxyCreator"/>

   <bean class="org.springframework.transaction.interceptor.BeanFactoryTransactionAttributeSourceAdvisor">
       <property name="transactionInterceptor" ref="transactionInterceptor"/>
   </bean>

   <bean id="transactionInterceptor" class="org.springframework.transaction.interceptor.TransactionInterceptor">
       <property name="transactionManager" ref="transactionManager"/>
       <property name="transactionAttributeSource">
           <bean class="org.springframework.transaction.annotation.AnnotationTransactionAttributeSource"/>
       </property>
   </bean>
   #+END_SRC
   InfrastructureAdvisorAutoProxyCreator是一个beanPostProcessor, 他会自动扫描beanFactory里面所有的Advisor
   在postProcessAfterInitialization方法中对bean应用Advisor

* 注意点

1. In Spring AOP, it is not possible to have aspects themselves be the target of advice from other
   aspects. The @Aspect annotation on a class marks it as an aspect, and hence excludes it from
   auto-proxying.
2. Due to the proxy-based nature of Spring’s AOP framework, protected methods are by definition
   not intercepted, neither for JDK proxies (where this isn’t applicable) nor for CGLIB proxies (where
   this is technically possible but not recommendable for AOP purposes). As a consequence, any
   given pointcut will be matched against public methods only!
3. 由于spring-aop基于proxy,所以类内部的方法相互调用不会触发advice