spring/aop.html

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> ProxyFactoryBean</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #424242; font-weight: bold;">bean</span> <span style="color: #4fa8a8;">id</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">myAdvisor</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">class</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">com.mycompany.MyAdvisor</span><span style="color: #b85c57;">"</span>&gt;
  &lt;<span style="color: #424242; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">someProperty</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">value</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">Custom string property value</span><span style="color: #b85c57;">"</span>/&gt;
&lt;/<span style="color: #424242; font-weight: bold;">bean</span>&gt;

&lt;<span style="color: #000000; background-color: #ff00ff; font-weight: bold;">bean</span> <span style="color: #4fa8a8;">id</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">debugInterceptor</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">class</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">org.springframework.aop.interceptor.DebugInterceptor</span><span style="color: #b85c57;">"</span>/&gt;

&lt;<span style="color: #424242; font-weight: bold;">bean</span> <span style="color: #4fa8a8;">id</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">person</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">class</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">org.springframework.aop.framework.ProxyFactoryBean</span><span style="color: #b85c57;">"</span>&gt;
  &lt;<span style="color: #424242; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">proxyInterfaces</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">value</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">com.mycompany.Person</span><span style="color: #b85c57;">"</span>/&gt;
  <span style="color: #40883f;">&lt;!--</span><span style="color: #40883f;"> Use inner bean, not local reference to target </span><span style="color: #40883f;">--&gt;</span>
  &lt;<span style="color: #424242; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">target</span><span style="color: #b85c57;">"</span>&gt;
    &lt;<span style="color: #424242; font-weight: bold;">bean</span> <span style="color: #4fa8a8;">class</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">com.mycompany.PersonImpl</span><span style="color: #b85c57;">"</span>&gt;
      &lt;<span style="color: #424242; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #000000; background-color: #ff00ff;">name</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">value</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">Tony</span><span style="color: #b85c57;">"</span>/&gt;
      &lt;<span style="color: #424242; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">age</span><span style="color: #b85c57;">"</span> <span style="color: #4fa8a8;">value</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">51</span><span style="color: #b85c57;">"</span>/&gt;
    &lt;/<span style="color: #424242; font-weight: bold;">bean</span>&gt;
  &lt;/<span style="color: #424242; font-weight: bold;">property</span>&gt;
  &lt;<span style="color: #000000; background-color: #ff00ff; font-weight: bold;">property</span> <span style="color: #4fa8a8;">name</span>=<span style="color: #b85c57;">"</span><span style="color: #b85c57;">interceptorNames</span><span style="color: #b85c57;">"</span>&gt;
    &lt;<span style="color: #424242; font-weight: bold;">list</span>&gt;
      &lt;<span style="color: #424242; font-weight: bold;">value</span>&gt;myAdvisor&lt;/<span style="color: #424242; font-weight: bold;">value</span>&gt;
      &lt;<span style="color: #000000; background-color: #ff00ff; font-weight: bold;">value</span>&gt;debugInterceptor&lt;/<span style="color: #424242; font-weight: bold;">value</span>&gt;
    &lt;/<span style="color: #424242; font-weight: bold;">list</span>&gt;
  &lt;/<span style="color: #424242; font-weight: bold;">property</span>&gt;
&lt;/<span style="color: #424242; font-weight: bold;">bean</span>&gt;
</pre>
</div>

<p>
The value can be advisor or advice.If you added an interceptor or other advice type, Spring
will have wrapped this in an advisor with a pointcut that always returns true. Thus if you added a
MethodInterceptor, the actual advisor returned will be an DefaultPointcutAdvisor which
returning your MethodInterceptor and a pointcut that matches all classes and methods.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> ProxyFactory</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #0287c8; font-weight: bold;">ProxyFactory</span> <span style="color: #4fa8a8;">factory</span> = <span style="color: #989848;">new</span> <span style="color: #0287c8; font-weight: bold;">ProxyFactory</span>(myBusinessInterfaceImpl);
factory.addAdvice(myMethodInterceptor);
factory.addAdvisor(myAdvisor);
<span style="color: #0287c8; font-weight: bold;">MyBusinessInterface</span> <span style="color: #4fa8a8;">tb</span> = (<span style="color: #0287c8; font-weight: bold;">MyBusinessInterface</span>) factory.getProxy();
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 源码分析</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-java">&lt;bean <span style="color: #989848;">class</span>=<span style="color: #b85c57;">"org.springframework.aop.framework.autoproxy.InfrastructureAdvisorAutoProxyCreator"</span>/&gt;

&lt;bean <span style="color: #989848;">class</span>=<span style="color: #b85c57;">"org.springframework.transaction.interceptor.BeanFactoryTransactionAttributeSourceAdvisor"</span>&gt;
    &lt;property name=<span style="color: #b85c57;">"transactionInterceptor"</span> ref=<span style="color: #b85c57;">"transactionInterceptor"</span>/&gt;
&lt;/bean&gt;

&lt;bean id=<span style="color: #b85c57;">"transactionInterceptor"</span> <span style="color: #989848;">class</span>=<span style="color: #b85c57;">"org.springframework.transaction.interceptor.TransactionInterceptor"</span>&gt;
    &lt;property name=<span style="color: #b85c57;">"transactionManager"</span> ref=<span style="color: #b85c57;">"transactionManager"</span>/&gt;
    &lt;property name=<span style="color: #b85c57;">"transactionAttributeSource"</span>&gt;
        &lt;bean <span style="color: #989848;">class</span>=<span style="color: #b85c57;">"org.springframework.transaction.annotation.AnnotationTransactionAttributeSource"</span>/&gt;
    &lt;/property&gt;
&lt;/bean&gt;
</pre>
</div>
<p>
InfrastructureAdvisorAutoProxyCreator是一个beanPostProcessor, 他会自动扫描beanFactory里面所有的Advisor
在postProcessAfterInitialization方法中对bean应用Advisor
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 注意点</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>In Spring AOP, it is not possible to have aspects themselves be the target of advice from other
aspects. The @Aspect annotation on a class marks it as an aspect, and hence excludes it from
auto-proxying.
</li>
<li>Due to the proxy-based nature of Spring’s AOP framework, protected methods are by definition
not intercepted, neither for JDK proxies (where this isn’t applicable) nor for CGLIB proxies (where
this is technically possible but not recommendable for AOP purposes). As a consequence, any
given pointcut will be matched against public methods only!
</li>
<li>由于spring-aop基于proxy,所以类内部的方法相互调用不会触发advice
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2018-01-12 Fri 14:54</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>